{"class_name": "Sequential", "keras_version": "2.0.6", "config": [{"class_name": "Dense", "config": {"bias_regularizer": null, "units": 300, "activation": "sigmoid", "name": "dense_1", "kernel_constraint": null, "batch_input_shape": [null, 39], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dtype": "float32", "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "use_bias": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "units": 300, "activation": "sigmoid", "name": "dense_2", "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "use_bias": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "units": 300, "activation": "sigmoid", "name": "dense_3", "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "use_bias": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "units": 19, "activation": "softmax", "name": "dense_4", "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "use_bias": true}}], "backend": "tensorflow"}