{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "activation": "sigmoid", "batch_input_shape": [null, 39], "name": "dense_1", "bias_constraint": null, "activity_regularizer": null, "units": 300, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "activation": "sigmoid", "units": 300, "name": "dense_2", "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "activation": "sigmoid", "units": 300, "name": "dense_3", "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "activation": "softmax", "units": 19, "name": "dense_4", "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true}}], "keras_version": "2.0.6"}