{"config": [{"config": {"bias_constraint": null, "activity_regularizer": null, "dtype": "float32", "name": "dense_1", "use_bias": true, "units": 300, "batch_input_shape": [null, 39], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "sigmoid"}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_2", "use_bias": true, "units": 300, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "activation": "sigmoid"}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_3", "use_bias": true, "units": 300, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "activation": "sigmoid"}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_4", "use_bias": true, "units": 19, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "activation": "softmax"}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.6", "class_name": "Sequential"}