{"keras_version": "2.0.6", "backend": "tensorflow", "config": [{"config": {"kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "units": 300, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_1", "activation": "sigmoid", "bias_constraint": null, "batch_input_shape": [null, 39], "dtype": "float32", "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "units": 300, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "sigmoid", "bias_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "units": 300, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "sigmoid", "bias_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "units": 19, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "bias_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "name": "dense_4"}, "class_name": "Dense"}], "class_name": "Sequential"}