{"backend": "tensorflow", "config": [{"config": {"dtype": "float32", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "units": 300, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 39], "kernel_regularizer": null, "activation": "sigmoid", "name": "dense_1", "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "units": 300, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "activation": "sigmoid", "name": "dense_2", "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "units": 300, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "activation": "sigmoid", "name": "dense_3", "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "units": 19, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "activation": "softmax", "name": "dense_4", "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}], "keras_version": "2.0.6", "class_name": "Sequential"}