{"config": [{"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "units": 300, "batch_input_shape": [null, 39], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "trainable": true, "bias_constraint": null, "name": "dense_1", "activation": "sigmoid", "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "units": 300, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "use_bias": true, "activation": "sigmoid", "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "units": 300, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "use_bias": true, "activation": "sigmoid", "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "units": 19, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "use_bias": true, "activation": "softmax", "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_4"}, "class_name": "Dense"}], "keras_version": "2.0.6", "class_name": "Sequential", "backend": "tensorflow"}