{"keras_version": "2.0.6", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 300, "activity_regularizer": null, "batch_input_shape": [null, 39], "bias_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "name": "dense_1", "dtype": "float32"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 300, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "name": "dense_2", "kernel_constraint": null}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 300, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "name": "dense_3", "kernel_constraint": null}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 19, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "name": "dense_4", "kernel_constraint": null}}]}