{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.6", "config": [{"class_name": "Dense", "config": {"batch_input_shape": [null, 39], "bias_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "units": 300, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "units": 300, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "sigmoid", "trainable": true, "name": "dense_2", "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "units": 300, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "sigmoid", "trainable": true, "name": "dense_3", "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "units": 19, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "softmax", "trainable": true, "name": "dense_4", "kernel_regularizer": null}}]}