{"keras_version": "2.0.6", "config": [{"class_name": "Dense", "config": {"units": 300, "use_bias": true, "kernel_regularizer": null, "activation": "sigmoid", "kernel_constraint": null, "bias_regularizer": null, "name": "dense_1", "dtype": "float32", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 39], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "bias_constraint": null}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": null, "activation": "sigmoid", "kernel_constraint": null, "name": "dense_2", "units": 300, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "bias_constraint": null}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": null, "activation": "sigmoid", "kernel_constraint": null, "name": "dense_3", "units": 300, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "bias_constraint": null}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": null, "activation": "softmax", "kernel_constraint": null, "name": "dense_4", "units": 19, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "trainable": true, "bias_constraint": null}}], "class_name": "Sequential", "backend": "tensorflow"}