{"config": [{"config": {"batch_input_shape": [null, 129], "kernel_constraint": null, "activity_regularizer": null, "name": "dense_1", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "units": 300, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "sigmoid", "dtype": "float32", "kernel_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "activity_regularizer": null, "name": "dense_2", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 300, "activation": "sigmoid", "kernel_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "activity_regularizer": null, "name": "dense_3", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 300, "activation": "sigmoid", "kernel_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "activity_regularizer": null, "name": "dense_4", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 19, "activation": "softmax", "kernel_regularizer": null, "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.6", "backend": "tensorflow"}