{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"name": "dense_1", "dtype": "float32", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "units": 300, "activation": "sigmoid", "batch_input_shape": [null, 129], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "units": 300, "activation": "sigmoid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "units": 300, "activation": "sigmoid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_4", "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "units": 19, "activation": "softmax", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null}}], "backend": "tensorflow", "keras_version": "2.0.6"}