{"config": [{"config": {"use_bias": true, "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 129], "kernel_regularizer": null, "name": "dense_1", "activation": "sigmoid", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "units": 300, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "name": "dense_2", "activation": "sigmoid", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "units": 300, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "name": "dense_3", "activation": "sigmoid", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "units": 300, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "name": "dense_4", "activation": "softmax", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "units": 19, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "keras_version": "2.0.6", "class_name": "Sequential", "backend": "tensorflow"}