{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.6", "config": [{"class_name": "Dense", "config": {"dtype": "float32", "kernel_constraint": null, "bias_constraint": null, "units": 300, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_1", "activity_regularizer": null, "activation": "sigmoid", "batch_input_shape": [null, 1281], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_constraint": null, "units": 300, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_2", "activity_regularizer": null, "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_constraint": null, "units": 300, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_3", "activity_regularizer": null, "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_constraint": null, "units": 19, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_4", "activity_regularizer": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}]}