{"backend": "tensorflow", "config": [{"config": {"bias_regularizer": null, "units": 300, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "use_bias": true, "batch_input_shape": [null, 257], "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "name": "dense_1", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "units": 300, "name": "dense_2", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "units": 300, "name": "dense_3", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "units": 19, "name": "dense_4", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "softmax", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.0.6", "class_name": "Sequential"}