{"keras_version": "2.0.6", "backend": "tensorflow", "config": [{"config": {"kernel_regularizer": null, "batch_input_shape": [null, 39], "activity_regularizer": null, "units": 300, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "bias_constraint": null, "activation": "sigmoid", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "activity_regularizer": null, "units": 300, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_2", "bias_constraint": null, "activation": "sigmoid", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "activity_regularizer": null, "units": 300, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_3", "bias_constraint": null, "activation": "sigmoid", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "activity_regularizer": null, "units": 19, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_4", "bias_constraint": null, "activation": "softmax", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}