{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"name": "dense_1", "bias_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "activation": "sigmoid", "bias_constraint": null, "kernel_constraint": null, "units": 300, "batch_input_shape": [null, 39], "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, {"class_name": "Dense", "config": {"name": "dense_2", "bias_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid", "bias_constraint": null, "kernel_constraint": null, "units": 300, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"name": "dense_3", "bias_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid", "bias_constraint": null, "kernel_constraint": null, "units": 300, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"name": "dense_4", "bias_regularizer": null, "kernel_regularizer": null, "activation": "softmax", "bias_constraint": null, "kernel_constraint": null, "units": 19, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "keras_version": "2.0.6"}