{"backend": "tensorflow", "config": [{"config": {"kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "sigmoid", "activity_regularizer": null, "trainable": true, "batch_input_shape": [null, 39], "units": 300, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "dense_1", "bias_constraint": null, "dtype": "float32"}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "units": 300, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "dense_2", "bias_constraint": null}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "units": 300, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "dense_3", "bias_constraint": null}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "activation": "softmax", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "units": 19, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "dense_4", "bias_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.6"}