{"config": [{"config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "name": "dense_1", "batch_input_shape": [null, 39], "activity_regularizer": null, "activation": "sigmoid", "dtype": "float32", "kernel_regularizer": null, "units": 300, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "name": "dense_2", "activity_regularizer": null, "activation": "sigmoid", "bias_regularizer": null, "kernel_regularizer": null, "units": 300, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "name": "dense_3", "activity_regularizer": null, "activation": "sigmoid", "bias_regularizer": null, "kernel_regularizer": null, "units": 300, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "name": "dense_4", "activity_regularizer": null, "activation": "softmax", "bias_regularizer": null, "kernel_regularizer": null, "units": 19, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.6", "backend": "tensorflow"}