{"config": [{"config": {"dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 300, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "name": "dense_1", "batch_input_shape": [null, 39], "activation": "sigmoid", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 300, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "name": "dense_2", "bias_constraint": null, "activation": "sigmoid", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 300, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "name": "dense_3", "bias_constraint": null, "activation": "sigmoid", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 19, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "name": "dense_4", "bias_constraint": null, "activation": "softmax", "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.6", "backend": "tensorflow"}